Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/coming_to_live_in_ireland/support_services_for_foreign_nationals.html.txt.tmx
Source language: en
Languages: ga

source: Support services for foreign nationals in Ireland
ga: Seirbhísí tacaíochta do náisiúnaigh choigríche in Éirinn

source: There is a range of supports for foreign nationals in Ireland and this document is an overview of some of the various public and voluntary supports available
ga: Tá raon de thacaíochtaí do náisiúnaigh choigríche in Éirinn agus tugann an doiciméad seo léargas ginearálta ar chuid de na tacaíochtaí poiblí agus deonacha atá ar fáil

source: People come to Ireland from other countries for a variety of reasons; for example, as tourists or short-term visitors
ga: Tagann daoine go hÉirinn ó thíortha eile ar chúiseanna éagsúla; mar shampla, mar thurasóirí nó mar chuairteoirí gearrthéarmacha

source: Many foreign nationals are working or studying here while others have retired to Ireland
ga: Tá a lán náisiúnaigh choigríche ag obair nó ag staidéar anseo agus tá cuid eile acu scortha go hÉirinn

source: Some people may be looking for protection and intend to apply for refugee status or other protection
ga: Is dócha go bhfuil roinnt daoine ar lorg cosanta agus go bhfuil sé ar intinn acu cur isteach ar stádas dídeanaí nó ar chosaint eile

source: If you are moving to Ireland you need find out information about living here including housing, residency, health services and employment
ga: Ma tá tú ar tí bogadh go hÉirinn caithfidh tú eolas a fháil faoi chúrsaí maireachtála anseo lena n-áirítear tithíocht, cónaitheacht, seirbhísí sláinte agus fostaíocht

source: Garda Racial, Intercultural and Diversity Office
ga: Oifig an Gharda Síochána um Chiníochas, Ilchultúrachas agus Ilchineálacht

source: The Garda Racial, Intercultural and Diversity Office (GRIDO) is responsible for advising, monitoring and co-ordinating police activity around racial, ethnic, religious and cultural diversity. A recording mechanism captures data concerning racially motivated incidents
ga: Tá Oifig an Gharda Síochána um Chiníochas, Ilchultúrachas agus Ilchineálacht freagrach as gníomhaíocht an Gharda a chomhairliú, a fhaireachán agus a chomhordú maidir le héagsúlacht chiníoch, eitneach, reiligiúnach agus cultúrtha

source: This data is made available to all Garda stations in the country so every incident is logged and reports and complaints can be tracked. Ethnic Liaison Officers (ELOs) monitor racist incidents
ga: Tá meicníocht thaifeadta á forbairt faoi láthair ag an oifig a dhéanfaidh sonraí a ghabháil maidir le teagmhais a spreagtar ag ciníochas

source: They also liaise with representatives of the various minority communities and with victims of racist incidents to ensure that they are afforded adequate protection
ga: Cuirfear na sonraí seo ar fáil do gach stáisiún Garda ionas go ndéanfar gach teagmhas a logáil agus tuairiscí agus gearáin a lorg

source: GRIDO maintains relationships with all communities through initiatives which promote mutual awareness and understanding
ga: Bunaíodh naisc fosta le seirbhísí a sholáthraíonn tacaíocht d’íospartaigh na coireachta maidir le saincheisteanna ciníochais

source: Irish Tourist Assistance Service
ga: Seirbhís Chúnaimh do Thurasóirí na hÉireann

source: Taking basic precautions can help you avoid being a victim of crime
ga: Is féidir leat gan bheith i d'íospartach na coireachta agus réamhchúraim bhunúsacha a ghlacadh agat

source: If however you have experienced crime, the Irish Tourist Assistance Service (ITAS) can be of help
ga: Ach má bhí tú i d'íospartach na coireachta, áfach, is féidir le Seirbhís Chúnaimh do Thurasóirí na hÉireann (SCTÉ) cuidiú leat

source: ITAS is a free nationwide service offering support and assistance to tourists who are victimised while visiting Ireland
ga: Is seirbhís shaor ar fud na tíre í SCTÉ a sholáthraíonn tacaíocht agus cúnamh do thurasóirí ar a ndéantar íospairt agus iad ar chuairt go hÉirinn

source: It can liaise with embassies or consulates, help with language difficulties, deal with medical needs, arrange accommodation or meals if needed and help to replace stolen travel tickets
ga: Is féidir leis idirchaidreamh a dhéanamh le hambasáidí nó consalachtaí, cuidiú le deachrachtaí teanga, déileáil le riachtanais mhíochaine, lóistín nó béilte a eagrú agus cuidiú le ticéid taistil goidte a athsholáthar

source: Remember however, ITAS does not provide financial assistance to victims of crime, replace lost or stolen items or offer legal or insurance advice
ga: Coinnigh cuimhne, áfach, nach solathraíonn SCTÉ cúnamh airgeadais d'íospartaigh na coireachta, nach ndéanann sí míreanna caillte nó goidte a athsholáthar nó nach dtáirgeann sí comhairle dhlíthiúil nó árachais

source: Foreign embassies and consulates
ga: Ambasáidí agus consalachtaí coigríche

source: There are a number of foreign embassies and consulates in Ireland that provide consular services to nationals of their country
ga: Tá roinnt ambasáidí agus consalachtaí coigríche in Éirinn a sholáthraíonn seirbhísí consalachta do náisiúnaigh a dtíre

source: These services include advice and practical help with travel documentation
ga: Cuimsíonn na seirbhísí seo comhairle agus cúnamh praiticiúil le doiciméadú taistil

source: If you lose your passport or travel documentation when you are in Ireland, you will need to contact your country’s embassy or consulate
ga: Má chailleann tú do phas nó doiciméadú taistil agus tusa inÉirinn, ní mór duit teagmháil a dhéanamh le hambasáid nó consalacht do thíre

source: It can issue you with temporary travel documents
ga: Is féidir leo doiciméid thaistil sealadacha a eisiúint duit

source: Your embassy or consulate can also be of assistance to you in the case of a medical emergency
ga: Is féidir le d'ambasáid nó consalacht cuidiú leat i gcás éigeandála míochaine

source: They can advise relatives or friends about accidents or illnesses, act as a liaison with hospitals and doctors and arrange for interpretative services, if necessary
ga: Is féidir leo gaolta nó cairde a chomhairliú maidir le timpistí nó tinnis, gníomhú mar theagmháil le hospidéil agus dochtúirí agus seirbhísí ateangaireachta a eagrú, más gá

source: If you are the victim of a crime while in Ireland, your embassy or consulate can liaise with local police and let your friends and family know of your situation
ga: Má tharlaíonn gur íospartach na coireachta tú agus tusa in Éirinn, is féidir le d'ambasáid nó consalacht idirchaidreamh a dhéanamh leis na póilíní áitiúla agus a chur in iúl do do chairde agus do do theaghlach faoi do chás

source: Likewise, if you have been arrested or imprisoned, your embassy or consulate can put you in contact with suitable legal representation, ensure that your rights are respected and advise you of your entitlements
ga: Ar an chaoi céanna, má gabhadh tú nó má cuireadh i bpriosún tú, is féidir le d'ambasáid nó consalacht tú a chur i dteagmháil le hionadaíocht

source: If a member of your family dies while abroad, your embassy or consulate can assist you in dealing with the formalities, such as death certificates and police reports
ga: dhlíthiúil chuí, a chinntiú go dtugtar meas ar do chearta agus comhairle a thabhairt duit faoi do theidlíochtaí

source: Immigrant Council of Ireland
ga: Comhairle Inimirceach na hÉireann

source: The Immigrant Council of Ireland (ICI) is an independent, national organisation which supports migrants coming to Ireland for purposes such as work, study, family reunification, self-employment or to visit
ga: Is eagraíocht neamhspleách náisiúnta í Comhairle Inimirceach na hÉireann a thacaíonn le hinimircigh a thagann go hÉireann ar chuspóirí oibre, staidéir, athaontaithe teaghlaigh, féinfhostaíochta nó ar chuairt

source: The ICI provides an information service and a limited legal service to immigrants
ga: Soláthraíonn CIÉ seirbhís eolais agus seirbhís dhlíthiúil teoranta d'inimircigh

source: It also offers a training service, organises public events and produces publications on immigrant issues such as citizenship and residency, visas, employment permits, family reunification and voluntary return
ga: Soláthraíonn sí seirbhís oiliúna fosta, eagraíonn sí imeachtaí poiblí agus táirgeann sí foilseacháin ar shaincheisteanna inimirce mar shaoránacht agus cónaitheacht, víosaí, ceadanna fostaíochta, athaontú teaghlaigh agus filleadh toilteanach

source: The ICI works with immigrant groups to try and improve government policy on issues relating to immigrants and to campaign for immigrants rights
ga: Oibríonn an CIÉ le grúpaí inimirceacha le cuidiú le polasaí rialtais a fheabhsú maidir le saincheisteanna a bhaineann le himircigh agus le dul i mbun feachtais ar son chearta na n-imnimirceach

source: It has produced a directory of ethnic-led organisations which is a resource for people seeking contacts within the migrant communities, with the media, service providers or businesses. The ICI has started regular clinics offering free and confidential employment law advice for migrant workers
ga: Tháirg sí eolaire d'eagraíochtaí bunaithe ar eitneachas atá ina acmhainn do dhaoine a bhíonn ar lorg teagmhálacha laistigh de na pobail imirceacha, leis na meáin, le soláthraithe seirbhíse nó le gnólachtaí

source: The Migrant Rights Centre (MRC) is a national organisation which provides support to migrant workers and their families
ga: Is eagraíocht náisiúnta é Lárionad Chearta na n-Imirceach (LCI) a sholáthraíonn tacaíocht d'oibrithe imirceacha agus a dteaghlaigh

source: It targets families in vulnerable circumstances and tries to improve their social and economic conditions
ga: Díríonn sé ar theaghlaigh atá i staideanna leochaileacha agus tugann sé iarracht a ndálaí sóisialta agus eacnamaíocha a fheabhsú

source: The MRC operates a drop-in centre which provides information, advice and assistance
ga: Oibríonn an LCI ionad buail isteach a sholáthraíonn eolas, comhairle agus cúnamh

source: It also encourages migrants to get involved in their community and actively participate in all levels of society
ga: Spreagann sé imircigh fosta chun baint a bheith acu ina bpobal féin agus chun páirt a ghlacadh i ngach leibhéal na sochaí

source: Crosscare Migrant Project (formerly Emigrant Advice) provides information, support and advocacy to migrants
ga: Soláthraíonn Tionscadal Imircigh Crosscare (ar tugadh Comhairle Eisimircigh air roimhe seo) faisnéis, tacaíocht agus abhcóideacht d'imircigh

source: It provides its information and referral service to immigrants and members of new communities living in Ireland, as well as to intending, existing and returning Irish emigrants
ga: Soláthraíonn a sheirbhís fhaisnéise agus atreoraithe d'inimircigh agus do bhaill phobail nua atá ina gcónaí in Éirinn, chomh maith le heisimircigh atá ar intinn, láithreach nó ag teacht ar ais

source: Its website livinginireland.ie is a guide to all aspects of living in Ireland and is available in English, Brazilian Portuguese, Arabic, Russian and Chinese
ga: Is a shuíomh gréasáin livinginireland.ie é treoir do gach gné chónaithe in Éirinn agus tá sé ar fáil i mBéarla, Portaingéilis na Brasaíle, Araibis, Rúisis agus Sínis

source: Reception and Integration Agency
ga: An Ghníomhaireacht um Fháiltiú agus Imeascadh

source: The Reception and Integration Agency (RIA) is responsible for co-ordinating the provision of services to both asylum seekers and people granted international protection (refugee status or subsidiary protection) in Ireland
ga: Tá an Ghníomhaireacht um Fháiltiú agus Imeascadh (GFI) freagrach as soláthar seirbhísí a chomhordú do lucht iarrtha tearmainn agus d'imircigh araon in Éirinn

source: It deals with integration policy for people who have international protection and people who have been granted leave to remain in the State
ga: Pléann sí le polasaí imeasctha d'imircigh uile agus do dhaoine a dtugadh cead dóibh fanacht sa Stát

source: It arranges accommodation and works with statutory and non-statutory agencies to co-ordinate the delivery of other services (including health, social services, welfare and education) for asylum seekers and people who have international protection
ga: Socraíonn sí lóistín agus oibríonn sí le gníomhaireachtaí reachtúla agus neamhreachtúla chun soláthar seirbhísí eile a chomhordú (lena n-áirítear sláinte, seirbhísí sóisialta, leas agus oideachas) do lucht iarrtha tearmainn agus d'imircigh

source: The RIA is also responsible for responding to crisis situations which result in large numbers of refugees arriving in Ireland within a short period of time
ga: Tá an GFI freagrach fosta as freagairt le cásanna géarchéime ar a mbíonn líonta móra dídeanaithe ag teacht chun na hÉireann laistigh de ghearrthréimhse mar thoradh

source: The Reception and Integration Agency works with the Department of Social Protection to support the repatriation of nationals of the new EU member states
ga: Oibríonn an Ghníomhaireacht um Fháiltiú agus Imeascadh leis an Roinn Coimirce Sóisialaí le tacú le haisdúichiú náisiúnach ó Bhallstáit nua an AE

source: The scheme applies to people who have failed the habitual residency condition attaching to social assistance payments
ga: Tá an scéim infheidhme le daoine ar theip orthu maidir le coinníoll na gnáthchónaitheachta atá nasctha le híocaíochtaí cúnaimh sóisialta

source: Any citizen of a former EU accession state, and certain other ‘special-case’ EU nationals, who find themselves destitute during their time in Ireland can apply for repatriation
ga: Is féidir le haon saoránach ó iarstát aontachais an AE, agus náisiúnaigh áirithe eile an AE atá in 'imthosc speisialta', atá i mbochtaineacht le linn a seala in Éirinn iarratas a dhéanamh ar aisdúiciú

source: If you wish to apply for this scheme you should contact the Department of Social Protection's representative (formerly known as the Community Welfare Officer) at your local health centre
ga: Chun iarratas a dhéanamh ar an scéim seo, téigh i dteagmháil leis an t-ionadaí Roinne Coimirce Sóisialaí (a tugadh an tOifigeach Leasa Pobail air roimhe seo) i d'ionad sláinte áitiúil

source: Scheme of voluntary assisted return
ga: Scéim um fhilleadh toilteanach cuidithe

source: If you are an asylum seeker or an irregular migrant from an non-EEA country who wishes to return voluntarily to your country of origin but do not have the means to do so, the International Organisation for Migration (IOM) may be able to assist you to return home
ga: Más iarrthóir tearmainn tú nó imirceach neamhrialta ó thír neamh-LEE ar mhian leat filleadh go toilteanach go do thír thionscnaimh ach níl na hacmhainní agat sin a dhéanamh, féadtar go mbeidh an Eagraíocht Idirnáisiúnta um Imirce (EII) in ann cuidiú leat filleadh abhaile

source: The IOM is an independent international organisation working in the field of migration - see 'Where to apply' below
ga: Is eagraíocht idirnáisiúnta neamhspleách í an EII a oibríonn i réimse na himirce - féach 'Áit le hiarratas a dhéanamh' thíos

source: Its Voluntary Assisted Return and Reintegration Scheme can help you with appropriate travel documentation and arrange for transit and arrival assistance if needed
ga: Is féidir leis an Scéim um Fhilleadh Deonach Cuidithe agus Athimeascadh cuidiú leat le doiciméid thaistil cuí agus cúnamh trasdula agus sroichte a eagrú más riachtanach

source: When you travel with the IOM, you travel independently and without an escort
ga: Nuair a thaistealaíonn tú leis an EII, taistealaíonn tú go neamhspleách agus gan duine coimhdeachta

source: The reasons for your stay in Ireland remain confidential and are not shared with anybody outside the voluntary return process
ga: Fanann cúiseanna do sheala in Éirinn rúnda agus ní roinntear le haon duine taobh amuigh den phróiseas um fhilleadh toilteanach iad

source: If you return voluntarily and you have no outstanding criminal court proceedings, you may apply to re-enter Ireland legally for the purpose of work, study, etc
ga: Má fhilleann tú go toilteanach agus mura bhfuil aon imeacht de chuid na cúirte coiriúla amuigh ort, is féidir leat iarraidh ar athiontráil go hÉirinn go dlíthiúil ar chúiseanna oibre, staidéir srl

source: Citizens Information is a comprehensive source of information on public services in Ireland including issues such as residence rights, employment rights, health services, housing, social security entitlements and general information about moving to Ireland
ga: Is foinse eolais cuimsitheach Faisnéis do Shaoránaigh maidir le seirbhísí poiblí in Éirinn. Tá eolas ar fáil ar shaincheisteanna mar chearta cónaitheachta, cearta fostaíochta, seirbhísí sláinte, tithíocht, teidlíochtaí leasa sóisialta agus eolas ginearálta maidir le bogadh go hÉirinn

source: Citizens Information is available by telephone through the Citizens Information Phone Service or in person by calling to a Citizens Information Centre (CIC) near you
ga: Tá faisnéis ar fáil do shaoránaigh fosta ar theileafón tríd an tSeirbhís Theileafóin um Fhaisnéis do Shaoránaigh nó go pearsanta trí chuairt ar Ionad Faisnéise do Shaoránaigh (IES) gar duit

source: If you are ordinarily resident in Ireland you are entitled to public health services on the same basis as Irish nationals
ga: Má bhíonn tú i do ghnáthchónaí in Éirinn tá tú i dteideal seirbhísí sláinte poiblí ar an bhonn céanna agus atá náisiúnaigh na hÉireann

source: Further information on health services is available from your Local Health Office
ga: Tá a thuilleadh eolais ar sheirbhísí sláinte ar fáil ó do Oifig Sláinte Áitiúil

source: If you are entitled to a social welfare payment in Ireland, you will need to visit your Intreo centre or social welfare office
ga: Má tá tú i dteideal íocaíochta leasa sóisialta in Éirinn, beidh ort cuairt a thabhairt ar d'oifig leasa sóisialta nó ionad Intreo áitiúil

source: If you are homeless, you should contact your local authority for information about accommodation
ga: Má tá tú gan dídean, ba chóir duit teagmháil a dhéanamh le d'údarás áitiúil le haghaidh eolais faoi lóistín

source: Threshold, a voluntary organisation, provides advice and support to people who are homeless or at risk of becoming homeless
ga: Is eagraíocht dheonach é Threshold a thugann comhairle agus tacaíocht dóibh atá gan dídean nó i mbaol easpa dídine

source: You can also get advice about your situation from your nearest Citizens Information Centre
ga: Is féidir leat freisin comhairle a fháil faoi do staid ón Lárionad Faisnéise do Shaoránaigh is deise duit

source: For further information on supports for foreign nationals in Ireland contact the following:
ga: Le tuilleadh eolais ar thacaíochtaí do náisiúnaigh coigríche in Éirinn déan teagmháil le:

source: Your local Citizens Information Centre or the Citizens Information Phone Service
ga: Do Ionad Faisnéise do Shaoránaigh áitiúil nó le Seirbhís Ghutháin um Fhaisnéis do Shaoránaigh

source: Opening Hours:Information and Referral Service: Mon, Tues, Thurs, Fri 10am - 1pm
ga: Uaireanta Oscailte:Seirbhís Fhaisnéise agus Atreoraithe: Luan, Máirt, Déardaoin, Aoine 10rn go 1in

source: Tel:+353 (0)1 674 0200
ga: Teil:+353 (0)1 674 0200

source: Fax:+353 (0)1 645 8059
ga: Facs:+353 (0)1 645 8059

source: Migrants Rights Centre Ireland
ga: Ionad um Chearta Imirceach Éire

source: Tel:+353 (0)1 873 2844
ga: Teil:+353 (0)1 873 2844

source: Fax:+353 (0)1 873 7003
ga: Facs:+353 (0)1 873 7003

source: Garda Racial, Intercultural & Diversity Office
ga: Oifig an Gharda Síochána um Chiníochas, Ilchultúrachas & Ilchineálacht

source: Garda Community Relations Bureau
ga: Biúró an Gharda Síochána um Chaidreamh Pobail
